国际摩尔斯密码定义一种标准编码方式，将每个字母对应于一个由一系列点和短线组成的字符串， 比如: "a" 对应 ".-", "b" 对应 "-...", "c" 对应 "-.-.", 等等。
为了方便，所有26个英文字母对应摩尔斯密码表如下：
[".-","-...","-.-.","-..",".","..-.","--.","....","..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...","-","..-","...-",".--","-..-","-.--","--.."]

给定一个单词列表，每个单词可以写成每个字母对应摩尔斯密码的组合。例如，"cab" 可以写成 "-.-..--..."，(即 "-.-." + ".-" + "-..." 字符串的结合)。我们将这样一个连接过程称作单词翻译。
返回我们可以获得所有词不同单词翻译的数量。

建立字符串数组morse，存放words中的字符串转成莫尔斯密码后的字符串，每次处理words中的字符串，如果不重复，就添加到morse里面，最终输出morse中字符串的个数

int uniqueMorseRepresentations(char ** words, int wordsSize){
    char dict[26][5] = {".-","-...","-.-.","-..",".","..-.","--.","....","..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...","-","..-","...-",".--","-..-","-.--","--.."};

    char morse[100][60] = {0};
    int count = 0;
    for (int i = 0; i < wordsSize; i++) {
        char tmp[60] = { 0 };
        int flag = 0;
        for (int j = 0; j < strlen(words[i]); j++) {
            strcat(tmp, dict[words[i][j] - 'a']);
        }
        for (int k = 0; k < count; k++) {
            if (strcmp(morse[k], tmp) == 0) {
                flag = 1;
                break;
            }
        }
        if (flag == 0) {
            strcpy(morse[count], tmp);
            count++;
        }
    }
    return count;
}
